check.txt


			<soapenv:Envelope
			xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
			xmlns:util="http://www.travelport.com/schema/util_v37_0"
			xmlns:com="http://www.travelport.com/schema/common_v37_0">
			<soapenv:Header/>
			<soapenv:Body>
			<shar:BookingStartReq TraceId="trace_89789" AuthorizedBy="user"
			TargetBranch="P7090934" ProviderCode="1G">
				<com:BillingPointOfSaleInfo OriginApplication="UAPI"/>
			</shar:BookingStartReq>
			</soapenv:Body>
			</soapenv:Envelope>
			
			<soapenv:Envelope
			xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
			xmlns:util="http://www.travelport.com/schema/util_v34_0"
			xmlns:com="http://www.travelport.com/schema/common_v34_0">
			<soapenv:Header/>
			<soapenv:Body>
			<shar:BookingStartReq TraceId="trace_89789" AuthorizedBy="user"
			TargetBranch="P7090934" ProviderCode="1G">
				<com:BillingPointOfSaleInfo OriginApplication="UAPI"/>
			</shar:BookingStartReq>
			</soapenv:Body>
			</soapenv:Envelope>
			
			<soapenv:Envelope
			xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
			xmlns:util="http://www.travelport.com/schema/util_v34_0"
			xmlns:com="http://www.travelport.com/schema/common_v34_0">
			<soapenv:Header/>
			<soapenv:Body>
			<shar:BookingStartReq TraceId="trace_89789" AuthorizedBy="TVPT"
			TargetBranch="P7090934" ProviderCode="1G">
				<com:BillingPointOfSaleInfo OriginApplication="UAPI"/>
			</shar:BookingStartReq>
			</soapenv:Body>
			</soapenv:Envelope>
				<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:shar="http://www.travelport.com/schema/sharedBooking_v34_0" xmlns:com="http://www.travelport.com/schema/common_v34_0">
<soapenv:Header/>
<soapenv:Body>
<shar:BookingStartReq TraceId="trace" AuthorizedBy="TVPT" TargetBranch="P7090934" ProviderCode="1G">
<com:BillingPointOfSaleInfo OriginApplication="UAPI"/>
</shar:BookingStartReq>
</soapenv:Body>
</soapenv:Envelope>
				<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:shar="http://www.travelport.com/schema/sharedBooking_v34_0" xmlns:com="http://www.travelport.com/schema/common_v34_0">
<soapenv:Header/>
<soapenv:Body>
<shar:BookingStartReq TraceId="c7e2d212-0e77-458e-87e9-e4b361ffdd3" AuthorizedBy="TVPT" TargetBranch="P7090934" ProviderCode="1G">
<com:BillingPointOfSaleInfo OriginApplication="UAPI"/>
</shar:BookingStartReq>
</soapenv:Body>
</soapenv:Envelope>
				<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
			xmlns:shar="http://www.travelport.com/schema/sharedBooking_v34_0"
			xmlns:com="http://www.travelport.com/schema/common_v34_0">
<soapenv:Header/>
<soapenv:Body>
<shar:BookingStartReq TraceId="c7e2d212-0e77-458e-87e9-e4b361ffdd3"
 TargetBranch="P7090934" ProviderCode="1G">
<com:BillingPointOfSaleInfo OriginApplication="UAPI"/>
</shar:BookingStartReq>
</soapenv:Body>
</soapenv:Envelope>
				<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
			xmlns:shar="http://www.travelport.com/schema/sharedBooking_v34_0"
			xmlns:com="http://www.travelport.com/schema/common_v34_0">
<soapenv:Header/>
<soapenv:Body>
<shar:BookingStartReq TraceId="c7e2d212-0e77-458e-87e9-e4b361ffdd8"
 TargetBranch="P7090934" ProviderCode="1G">
<com:BillingPointOfSaleInfo OriginApplication="UAPI"/>
</shar:BookingStartReq>
</soapenv:Body>
</soapenv:Envelope>
				<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
			xmlns:shar="http://www.travelport.com/schema/sharedBooking_v34_0"
			xmlns:com="http://www.travelport.com/schema/common_v34_0">
<soapenv:Header/>
<soapenv:Body>
<shar:BookingStartReq TraceId="c7e2d212-0e77-458e-87e9-e4b361ffdd8"
 TargetBranch="P7090934" ProviderCode="1G">
<com:BillingPointOfSaleInfo OriginApplication="UAPI"/>
</shar:BookingStartReq>
</soapenv:Body>
</soapenv:Envelope>
			
			<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
			xmlns:shar="http://www.travelport.com/schema/sharedBooking_v34_0"
			xmlns:com="http://www.travelport.com/schema/common_v34_0">
			<soapenv:Header/>
			<soapenv:Body>
				<shar:BookingStartReq TraceId="c7e2d212-0e77-458e-87e9-e4b361ffdd8"
				 TargetBranch="P7090934" ProviderCode="1G">
				<com:BillingPointOfSaleInfo OriginApplication="UAPI"/>
				</shar:BookingStartReq>
			</soapenv:Body>
			</soapenv:Envelope>
			<?xml version="1.0"?>
<air:AirAvailInfo ProviderCode="1G"/>
<?xml version="1.0"?>
<air:AirAvailInfo ProviderCode="1G"/>
<?xml version="1.0"?>
<xmlns:air:AirAvailInfo ProviderCode="1G"/>
<?xml version="1.0"?>
<air:AirAvailInfo ProviderCode="1G"/>
<?xml version="1.0"?>
<air:AirAvailInfo ProviderCode="1G"/>
<?xml version="1.0"?>
<air:AirAvailInfo ProviderCode="1G"/>
<?xml version="1.0"?>
<xmlns:air:AirAvailInfo ProviderCode="1G"/>
<shar:AddAirSegment><air:AirSegment Key="BmuGAC8Q2BKA7HAHAAAAAA==" Group="0" Carrier="PK" FlightNumber="302" Origin="KHI" Destination="LHE" DepartureTime="2020-03-03T08:00:00.000+05:00" ArrivalTime="2020-03-03T09:45:00.000+05:00" FlightTime="105" Distance="636" ETicketability="Yes" Equipment="772" ChangeOfPlane="false" ParticipantLevel="Secure Sell" LinkAvailability="true" PolledAvailabilityOption="No polled avail exists" OptionalServicesIndicator="false" AvailabilitySource="A" AvailabilityDisplayType="Fare Shop/Optimal Shop" ProviderCode="1G"/><air:AirSegment Key="BmuGAC8Q2BKA+IAHAAAAAA==" Group="1" Carrier="PK" FlightNumber="305" Origin="LHE" Destination="KHI" DepartureTime="2020-03-27T18:00:00.000+05:00" ArrivalTime="2020-03-27T19:45:00.000+05:00" FlightTime="105" Distance="636" ETicketability="Yes" Equipment="320" ChangeOfPlane="false" ParticipantLevel="Secure Sell" LinkAvailability="true" PolledAvailabilityOption="No polled avail exists" OptionalServicesIndicator="false" AvailabilitySource="A" AvailabilityDisplayType="Fare Shop/Optimal Shop" ProviderCode="1G"/></shar:AddAirSegment><?xml version="1.0"?>
<SOAP:Envelope xmlns:SOAP="http://schemas.xmlsoap.org/soap/envelope/"><SOAP:Body><air:AirPriceRsp xmlns:air="http://www.travelport.com/schema/air_v42_0" xmlns:common_v42_0="http://www.travelport.com/schema/common_v42_0" TraceId="trace" TransactionId="8664DBF20A076478D3ABDD5CFCE14B73" ResponseTime="1879"><common_v42_0:ResponseMessage Code="710401" Type="Warning" ProviderCode="1G">Taxes returned at the FareInfo level are for informational purposes only, and may differ from those returned at the Itinerary/Passenger Type levels.</common_v42_0:ResponseMessage><common_v42_0:ResponseMessage Code="4400" Type="Warning">No Merchandising optional services returned for Flight(s) [PK][302]</common_v42_0:ResponseMessage><common_v42_0:ResponseMessage Code="4400" Type="Warning">No Merchandising optional services returned for Flight(s) [PK][303]</common_v42_0:ResponseMessage><air:AirItinerary><air:AirSegment Key="xIaV9B4R2BKAHWndBAAAAA==" Group="0" Carrier="PK" FlightNumber="302" ProviderCode="1G" Origin="KHI" Destination="LHE" DepartureTime="2020-03-05T08:00:00.000+05:00" ArrivalTime="2020-03-05T09:45:00.000+05:00" FlightTime="105" TravelTime="105" Distance="636" ClassOfService="V" Equipment="320" ChangeOfPlane="false" OptionalServicesIndicator="false" AvailabilitySource="L" ParticipantLevel="Secure Sell" LinkAvailability="true" PolledAvailabilityOption="O and D cache or polled status used with different local status" AvailabilityDisplayType="Fare Specific Fare Quote Unbooked"><air:CodeshareInfo OperatingCarrier="PK">Pakistan International Airlines</air:CodeshareInfo><air:FlightDetails Key="xIaV9B4R2BKAIWndBAAAAA==" Origin="KHI" Destination="LHE" DepartureTime="2020-03-05T08:00:00.000+05:00" ArrivalTime="2020-03-05T09:45:00.000+05:00" FlightTime="105" TravelTime="105" Distance="636"/></air:AirSegment><air:AirSegment Key="xIaV9B4R2BKAJWndBAAAAA==" Group="1" Carrier="PK" FlightNumber="303" ProviderCode="1G" Origin="LHE" Destination="KHI" DepartureTime="2020-04-15T11:00:00.000+05:00" ArrivalTime="2020-04-15T12:45:00.000+05:00" FlightTime="105" TravelTime="105" Distance="636" ClassOfService="U" Equipment="772" ChangeOfPlane="false" OptionalServicesIndicator="false" AvailabilitySource="L" ParticipantLevel="Secure Sell" LinkAvailability="true" PolledAvailabilityOption="O and D cache or polled status used with different local status" AvailabilityDisplayType="Fare Specific Fare Quote Unbooked"><air:CodeshareInfo OperatingCarrier="PK">Pakistan International Airlines</air:CodeshareInfo><air:FlightDetails Key="xIaV9B4R2BKAKWndBAAAAA==" Origin="LHE" Destination="KHI" DepartureTime="2020-04-15T11:00:00.000+05:00" ArrivalTime="2020-04-15T12:45:00.000+05:00" FlightTime="105" TravelTime="105" Distance="636"/></air:AirSegment></air:AirItinerary><air:AirPriceResult><air:AirPricingSolution Key="xIaV9B4R2BKALWndBAAAAA==" TotalPrice="PKR57994" BasePrice="USD316.00" ApproximateTotalPrice="PKR57994" ApproximateBasePrice="PKR49100" EquivalentBasePrice="PKR49100" Taxes="PKR8894" Fees="PKR0" ApproximateTaxes="PKR8894" QuoteDate="2020-02-27"><air:AirSegmentRef Key="xIaV9B4R2BKAHWndBAAAAA=="/><air:AirSegmentRef Key="xIaV9B4R2BKAJWndBAAAAA=="/><air:AirPricingInfo Key="xIaV9B4R2BKAOWndBAAAAA==" TotalPrice="PKR28997" BasePrice="USD158.00" ApproximateTotalPrice="PKR28997" ApproximateBasePrice="PKR24550" EquivalentBasePrice="PKR24550" ApproximateTaxes="PKR4447" Taxes="PKR4447" LatestTicketingTime="2020-03-05T23:59:00.000+11:00" PricingMethod="Guaranteed" Refundable="true" IncludesVAT="false" ETicketability="Yes" PlatingCarrier="PK" ProviderCode="1G"><air:FareInfo Key="xIaV9B4R2BKATWndBAAAAA==" FareBasis="VOW1" PassengerTypeCode="ADT" Origin="KHI" Destination="LHE" EffectiveDate="2020-02-27T16:25:00.000+05:00" DepartureDate="2020-03-05" Amount="PKR11660" NotValidBefore="2020-03-05" NotValidAfter="2020-03-05" TaxAmount="PKR2201.00"><common_v42_0:Endorsement Value="PK ONLY/ NON END"/><air:FareRuleKey FareInfoRef="xIaV9B4R2BKATWndBAAAAA==" ProviderCode="1G">6UUVoSldxwhf2CtRJx2LY8bKj3F8T9EyxsqPcXxP0TLGyo9xfE/RMsuWFfXVd1OAly5qxZ3qLwOXLmrFneovA5cuasWd6i8Dly5qxZ3qLwOXLmrFneovA9PALQF81q3UfTobKkhimR/zd/VTAJtvZcX6kLq5NLcyJJJkSAQvpY50cxnQxWdzR/FwJcEQI4iTmV6437jYmQiF/oTXxxF6MeJYtF79PC3YfoLT9JoAKrPwx9zlz405AudTfBrAWJIW8ww0k2iGxkjg2BMJ0qOmdTyy/Q52QOiIVnkdwDk3yVSKFxIc5whYweaeJIc23zoev4Xvb2u1Qx+/he9va7VDH7+F729rtUMfv4Xvb2u1Qx+/he9va7VDH8ONhV50oNexly5qxZ3qLwMUu+QC5Q/Q9pxPze0DbQQdBsYNTAxfiho/nSeV0UNDqEljcImafmlT5GwF8kqQiiA=</air:FareRuleKey><air:Brand Key="xIaV9B4R2BKATWndBAAAAA==" BrandFound="false" UpSellBrandFound="false"/></air:FareInfo><air:FareInfo Key="xIaV9B4R2BKAVWndBAAAAA==" FareBasis="UOW1" PassengerTypeCode="ADT" Origin="LHE" Destination="KHI" EffectiveDate="2020-02-27T16:25:00.000+05:00" DepartureDate="2020-04-15" Amount="PKR12890" NotValidBefore="2020-04-15" NotValidAfter="2020-04-15" TaxAmount="PKR2246.00"><common_v42_0:Endorsement Value="PK ONLY/ NON END"/><air:FareRuleKey FareInfoRef="xIaV9B4R2BKAVWndBAAAAA==" ProviderCode="1G">6UUVoSldxwhf2CtRJx2LY8bKj3F8T9EyxsqPcXxP0TLGyo9xfE/RMsuWFfXVd1OAly5qxZ3qLwOXLmrFneovA5cuasWd6i8Dly5qxZ3qLwOXLmrFneovA9PALQF81q3UfTobKkhimR/zd/VTAJtvZfW9QYLKMdlCGqxwKzgb8d90cxnQxWdzR1vsIjtu02LzWjBb5O7YdSOF/oTXxxF6MeJYtF79PC3YfoLT9JoAKrPwx9zlz405AudTfBrAWJIW8ww0k2iGxkhJ6dYYb68oBzyy/Q52QOiIn746GlH2ck2duwz/kYqEh+aeJIc23zoev4Xvb2u1Qx+/he9va7VDH7+F729rtUMfv4Xvb2u1Qx+/he9va7VDH8ONhV50oNexly5qxZ3qLwMUu+QC5Q/Q9pxPze0DbQQdBsYNTAxfiho/nSeV0UNDqEljcImafmlT5GwF8kqQiiA=</air:FareRuleKey><air:Brand Key="xIaV9B4R2BKAVWndBAAAAA==" BrandFound="false" UpSellBrandFound="false"/></air:FareInfo><air:BookingInfo BookingCode="V" CabinClass="Economy" FareInfoRef="xIaV9B4R2BKATWndBAAAAA==" SegmentRef="xIaV9B4R2BKAHWndBAAAAA==" HostTokenRef="xIaV9B4R2BKAMWndBAAAAA=="/><air:BookingInfo BookingCode="U" CabinClass="Economy" FareInfoRef="xIaV9B4R2BKAVWndBAAAAA==" SegmentRef="xIaV9B4R2BKAJWndBAAAAA==" HostTokenRef="xIaV9B4R2BKANWndBAAAAA=="/><air:TaxInfo Category="N9" Amount="PKR25" Key="xIaV9B4R2BKAPWndBAAAAA=="/><air:TaxInfo Category="PK" Amount="PKR3000" Key="xIaV9B4R2BKAQWndBAAAAA=="/><air:TaxInfo Category="YI" Amount="PKR40" Key="xIaV9B4R2BKARWndBAAAAA=="/><air:TaxInfo Category="PB" Amount="PKR1382" Key="xIaV9B4R2BKASWndBAAAAA=="/><air:FareCalc>KHI PK LHE 75.00VOW1 PK KHI 83.00UOW1 USD158.00END</air:FareCalc><air:PassengerType Code="ADT"/><air:PassengerType Code="ADT"/><air:ChangePenalty><air:Amount>PKR3890.0</air:Amount></air:ChangePenalty><air:CancelPenalty><air:Amount>PKR3890.0</air:Amount></air:CancelPenalty><air:BaggageAllowances><air:BaggageAllowanceInfo TravelerType="ADT" Origin="KHI" Destination="LHE" Carrier="PK"><air:URLInfo><air:URL>VIEWTRIP.TRAVELPORT.COM/BAGGAGEPOLICY/PK</air:URL></air:URLInfo><air:TextInfo><air:Text>20K</air:Text><air:Text>BAGGAGE DISCOUNTS MAY APPLY BASED ON FREQUENT FLYER STATUS/ ONLINE CHECKIN/FORM OF PAYMENT/MILITARY/ETC.</air:Text></air:TextInfo><air:BagDetails ApplicableBags="1stChecked"><air:BaggageRestriction><air:TextInfo><air:Text>CHGS MAY APPLY IF BAGS EXCEED TTL WT ALLOWANCE</air:Text></air:TextInfo></air:BaggageRestriction></air:BagDetails><air:BagDetails ApplicableBags="2ndChecked"><air:BaggageRestriction><air:TextInfo><air:Text>CHGS MAY APPLY IF BAGS EXCEED TTL WT ALLOWANCE</air:Text></air:TextInfo></air:BaggageRestriction></air:BagDetails></air:BaggageAllowanceInfo><air:BaggageAllowanceInfo TravelerType="ADT" Origin="LHE" Destination="KHI" Carrier="PK"><air:URLInfo><air:URL>VIEWTRIP.TRAVELPORT.COM/BAGGAGEPOLICY/PK</air:URL></air:URLInfo><air:TextInfo><air:Text>20K</air:Text><air:Text>BAGGAGE DISCOUNTS MAY APPLY BASED ON FREQUENT FLYER STATUS/ ONLINE CHECKIN/FORM OF PAYMENT/MILITARY/ETC.</air:Text></air:TextInfo><air:BagDetails ApplicableBags="1stChecked"><air:BaggageRestriction><air:TextInfo><air:Text>CHGS MAY APPLY IF BAGS EXCEED TTL WT ALLOWANCE</air:Text></air:TextInfo></air:BaggageRestriction></air:BagDetails><air:BagDetails ApplicableBags="2ndChecked"><air:BaggageRestriction><air:TextInfo><air:Text>CHGS MAY APPLY IF BAGS EXCEED TTL WT ALLOWANCE</air:Text></air:TextInfo></air:BaggageRestriction></air:BagDetails></air:BaggageAllowanceInfo><air:CarryOnAllowanceInfo Origin="KHI" Destination="LHE" Carrier="PK"><air:TextInfo><air:Text>7K</air:Text></air:TextInfo><air:CarryOnDetails ApplicableCarryOnBags="1"><air:BaggageRestriction><air:TextInfo><air:Text>CHGS MAY APPLY IF BAGS EXCEED TTL WT ALLOWANCE</air:Text></air:TextInfo></air:BaggageRestriction></air:CarryOnDetails><air:CarryOnDetails ApplicableCarryOnBags="2"><air:BaggageRestriction><air:TextInfo><air:Text>CHGS MAY APPLY IF BAGS EXCEED TTL WT ALLOWANCE</air:Text></air:TextInfo></air:BaggageRestriction></air:CarryOnDetails></air:CarryOnAllowanceInfo><air:CarryOnAllowanceInfo Origin="LHE" Destination="KHI" Carrier="PK"><air:TextInfo><air:Text>7K</air:Text></air:TextInfo><air:CarryOnDetails ApplicableCarryOnBags="1"><air:BaggageRestriction><air:TextInfo><air:Text>CHGS MAY APPLY IF BAGS EXCEED TTL WT ALLOWANCE</air:Text></air:TextInfo></air:BaggageRestriction></air:CarryOnDetails><air:CarryOnDetails ApplicableCarryOnBags="2"><air:BaggageRestriction><air:TextInfo><air:Text>CHGS MAY APPLY IF BAGS EXCEED TTL WT ALLOWANCE</air:Text></air:TextInfo></air:BaggageRestriction></air:CarryOnDetails></air:CarryOnAllowanceInfo></air:BaggageAllowances></air:AirPricingInfo><air:FareNote Key="xIaV9B4R2BKAZWndBAAAAA==">RATE USED IN EQU TOTAL IS BSR 1USD - 155.36048PKR</air:FareNote><air:FareNote Key="xIaV9B4R2BKAaWndBAAAAA==">LAST DATE TO PURCHASE TICKET: 05MAR20</air:FareNote><air:FareNote Key="xIaV9B4R2BKAbWndBAAAAA==">TICKETING AGENCY 5EI5</air:FareNote><air:FareNote Key="xIaV9B4R2BKAcWndBAAAAA==">DEFAULT PLATING CARRIER PK</air:FareNote><air:FareNote Key="xIaV9B4R2BKAdWndBAAAAA==">FARE HAS A PLATING CARRIER RESTRICTION</air:FareNote><air:FareNote Key="xIaV9B4R2BKAeWndBAAAAA==">E-TKT REQUIRED</air:FareNote><air:FareNote Key="xIaV9B4R2BKAfWndBAAAAA==">TICKETING FEES MAY APPLY</air:FareNote><common_v42_0:HostToken Key="xIaV9B4R2BKAMWndBAAAAA==">GFB10101ADT00  01VOW1                                  010001#GFB200010101NADTV3302150004700001992J#GFMCER 302N1500 PK ADTVOW1</common_v42_0:HostToken><common_v42_0:HostToken Key="xIaV9B4R2BKANWndBAAAAA==">GFB10101ADT00  02UOW1                                  010002#GFB200010102NADTV3302150004700001992J#GFMCER 302N1500 PK ADTUOW1</common_v42_0:HostToken></air:AirPricingSolution></air:AirPriceResult></air:AirPriceRsp></SOAP:Body></SOAP:Envelope>
